%单位GeV
gs=100;Mp=1.22e19;mw=100;%暗物质粒子的质量，需要设定
c1=0.1738;c2=1.495;c3=-4.840;c4=1.594;
k1=1.403;k2=-0.5993;k3=-3.111;k4=0.8555;

i=0.1;g=10^i;%模型中的耦合常数，需要设定
fun=@(x,Y) -(sqrt(45/(4*pi^3*gs))*mw*Mp*(exp((k1*tanh(log10(x)+k2)+k3)*log10(x)+k4)*g^2/mw^2)) ...
*(Y^2-((c1+exp(-c2*x^2+c3))*exp(-x)*(x+c4)^1.5)^2)/x^2;%玻尔兹曼方程
x_range=[0.01 1000];%求解范围
%对热产生粒子求解范围建议设为[0.01 1000]。对非热产生粒子建议设为[Tp 1000],Tp为粒子产生时的温度。
Y0=0.3654; %初始条件，需要设定（热产生粒子设定为Y0=Yeq(0)，非热产生粒子设为Y0=0）
options=odeset('InitialStep',1e-6,'MaxStep',0.1);%求解精度
[x,Y]=ode23s(fun,x_range,Y0,options);%解方程
loglog(x,Y,'LineWidth',1.5);hold on %把求解结果画图